Local server


/******************************************************************************************/


/*==============================================================================================*/

Обращение к локальному серверу и создание тунелей для портов
1. lt --port 8000 
1.1 lt --port 3000
2. open env.sh
3. copy link to MOLLIE_WEB_Domain
3.1 copy link to MOLLIE Return page (lt 3000)
4. saleorrun.sh
4.1 run front
5. Перезапуск если нужен

// P.S. - после изменений в env.sh нужно прописать рестарт:
saleorrestart.sh 
