0.Введение в JavaScript
	- Что такое JavaScript?

/**************************************** Test *********************************************/
1. Блок (Что такое JavaScript?)
- Какова история  JavaScript?
- Как работают движки?
- Что может JavaScript?
- Почему JavaScript популярен?
- Какие еще языки похожы?

/******************************************************************************************/

/*================================= Что такое JavaScript? ===================================================*/

Изначально JavaScript был создан, чтобы «сделать веб-страницы живыми». Программы на этом языке называются скриптами.

Язык Java был очень популярен в то время, и было решено, что позиционирование JavaScript как «младшего брата» Java будет полезно.

Со временем JavaScript стал полностью независимым языком со своей собственной спецификацией, называющейся ECMAScript.

Сегодня JavaScript может выполняться не только в браузере, но и на сервере или на любом другом устройстве, которое имеет 
	специальную программу, называющуюся «движком» JavaScript. V8 – в Chrome и Opera

Как работают движки?
1. Движок (встроенный, если это браузер) читает («парсит») текст скрипта
2. Затем он преобразует («компилирует») скрипт в машинный язык
3. После этого машинный код запускается и работает достаточно быстро

В браузере для JavaScript доступно всё, что связано с манипулированием веб-страницами, взаимодействием с пользователем и веб-сервером.

Например, в браузере JavaScript может:
 - Добавлять новый HTML-код 
 - Реагировать на действия пользователя
 - Отправлять сетевые запросы
 - Получать и устанавливать куки
 - Запоминать данные на стороне клиента («local storage»).

Что делает JavaScript особенным?
 - Полная интеграция с HTML/CSS.
 - Простые вещи делаются просто.
 - Поддерживается всеми основными браузерами и включён по умолчанию.

Появилось много новых языков, которые транспилируются (конвертируются) в JavaScript, прежде чем запустятся в браузере:
 - CoffeeScript добавляет «синтаксический сахар» для JavaScript
 - TypeScript концентрируется на добавлении «строгой типизации»