18. ES6, ES7, ES8 - ВСЕ НОВОВВЕДЕНИЯ В JAVASCRIPT

- Иммутабельность в js
    
/******************************************************************************************/
// https://www.youtube.com/watch?v=Ti2Q4sQkNdU&ab_channel=%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BB%D0%B5%D0%BD%D0%9C%D0%B8%D0%BD%D0%B8%D0%BD

/*================================= Иммутабельность в js ===================================================*/

Неизменяемым (англ. immutable) тип данных, состояние которого не может быть изменено после создания.

Все приметивные типпы данных в js иммутабельны - так как их значения коппируються, соответственно выделяеться 
	новая ячейка памяти.

Обьекты - мутабельны, так как они передаються по ссылке и использует ту же ячейку памяти.