20. Каррирование
	- Каррирование

/******************************************************************************************/

// https://learn.javascript.ru/currying-partials
// https://www.youtube.com/watch?v=6E4tNlr5NLg&ab_channel=WebDev%D1%81%D0%BD%D1%83%D0%BB%D1%8F.%D0%9A%D0%B0%D0%BD%D0%B0%D0%BB%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%9B%D1%83%D1%89%D0%B5%D0%BD%D0%BA%D0%BE

/*================================= Каррирование ===================================================*/

Каррирование – это трансформация функций таким образом, чтобы они принимали аргументы не как f(a, b, c), а как f(a)(b)(c).

Каррирование - уменьшение количества аргументов.


Написать функцию: sum(1)(2)(3)

const a = b => c => d => b + c + d;