GraphQL
- Introduction


/******************************************************************************************/


/*================================ Introduction ==============================================*/

GraphQL - это язык запросов к API и среда выполнения этих запросов с имеющимися данными.

GraphQL обеспечивает полное и понятное описание данных в вашем API, дает клиентам возможность 
  запрашивать именно то, что им нужно и не более того, упрощает обновление API-интерфейсов с течением 
  времени и предоставляет мощные инструменты для разработчиков.
