GraphQL
- Introduction


/******************************************************************************************/


/*================================ Introduction ==============================================*/

GraphQL - это язык запросов к API и среда выполнения этих запросов с имеющимися данными.

GraphQL обеспечивает полное и понятное описание данных в вашем API, дает клиентам возможность 
  запрашивать именно то, что им нужно и не более того, упрощает обновление API-интерфейсов с течением 
  времени и предоставляет мощные инструменты для разработчиков.

GraphQL помогает полностью конфигурировать данные, которые мы хотим получить. Тоесть ничего лишнего
  тянуться не будет. Это значительно снижает нагрузку на сервер.


express - фреймворк для nodeJs
nodemon - пакет служит для того, чтобы мы не перезапускали сервер, когда меняем настройки
graphQL - библиотека запросов
express-graphQL - обертка для упрощения работы с graphQL
mongoose - библиотека js, которая служит для связки приложения с базой данных
cors - запросы между разлычными источниками
graphqlHTTP - пакет для того чтобы спокойно можно использовать graphQL Api