NextJS 
- Начало работы



/******************************************************************************************/
// https://www.youtube.com/watch?v=_EOrSmjdOZQ&ab_channel=%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BB%D0%B5%D0%BD%D0%9C%D0%B8%D0%BD%D0%B8%D0%BD
// https://github.com/vladilenm/next-crash-course

/*================================ Начало работы ==============================================*/

Next.js — JavaScript фреймворк, созданный поверх React.js для создания SSR приложений, созданный компанией Vercel.

SSR - server side rendering

SSR - создан для решение проблемы SEO выдачи, так это большая проблема в SPA.
Когда поисковые роботы заходят на SPA они видят пустой контент страницы - данные подставляються динамически